In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
revenue_series = Series([100,200,300,np.nan], index=['Audi','Mercedes','BMW','Toyota'])
print(revenue_series)

Audi        100.0
Mercedes    200.0
BMW         300.0
Toyota        NaN
dtype: float64

In [4]:
revenue_series.isnull()

Audi        False
Mercedes    False
BMW         False
Toyota       True
dtype: bool

In [6]:
revenue_series.dropna()

Audi        100.0
Mercedes    200.0
BMW         300.0
dtype: float64

In [7]:
#DataFrame - dropna()
df1 = DataFrame(np.random.randn(12).reshape(4,3))
print(df1)

          0         1         2
0 -0.612661  0.649083 -0.336541
1 -1.578718 -0.105420  0.811375
2 -0.342565 -1.619063 -1.149994
3 -1.779345  0.453753  2.307225

In [8]:
df1.loc[1,2] = np.nan
df1.loc[2,1] = np.nan
df1.loc[3,] = np.nan
#loc function is used to select individual elements of a Dataframe and assign values to them
print(df1)

          0         1         2
0 -0.612661  0.649083 -0.336541
1 -1.578718 -0.105420       NaN
2 -0.342565       NaN -1.149994
3       NaN       NaN       NaN

In [10]:
df1.dropna()

          0         1         2
0 -0.612661  0.649083 -0.336541

In [11]:
print(df1)

          0         1         2
0 -0.612661  0.649083 -0.336541
1 -1.578718 -0.105420       NaN
2 -0.342565       NaN -1.149994
3       NaN       NaN       NaN

In [13]:
#Disadvantages of dropping all NAN values in dataframe

In [14]:
df1.dropna(how='all')

          0         1         2
0 -0.612661  0.649083 -0.336541
1 -1.578718 -0.105420       NaN
2 -0.342565       NaN -1.149994

In [15]:
#DataFrane - dropna() along column
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
#Dropna with thresh parameter
df2 = DataFrame([[1,2,3,np.nan],
               [4,5,6,7],
               [8,9,np.nan,np.nan],
               [12,np.nan,np.nan,np.nan]])
print(df2)

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [17]:
df2.dropna(thresh=3)
#If three or more values exist in a row then show if less delete row

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [18]:
df2.dropna(thresh=2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0
2  8  9.0  NaN  NaN

In [19]:
#fillna() function
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [20]:
df2.fillna({0:0,1:50,2:100,3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0